public class Main {
    public static void main(String[] args) {
        /*Система управления библиотекой
        Цель проекта: разработать приложение для управления библиотекой, позволяющее добавлять, удалять, искать и выдавать книги.
                Требования к функционалу:
        1. Возможность добавления новых книг в библиотеку (с указанием названия, автора, жанра, года издания).
        2. Удаление книги из базы по ID или названию.
        3. Поиск книги по одному из параметров (ID, названию, автору).
        4. Регистрация и управление пользователями библиотеки (добавление/удаление пользователя).
        5. Функция "выдача книги": проверка, доступна ли книга, и закрепление её за пользователем.
        6. Возможность вернуть книгу, освобождая её для других пользователей.

        Техничка:
        Использовать Java и текстовые файлы для хранения данных (например, .txt или .csv).
        Основной интерфейс программы — консольный.

                Реализовать использование коллекций Java (ArrayList, HashMap).*/



    }
}